###  Results for `terraform plan` on `./lambda` 

<details>
<summary>Show output</summary>

```diff
module.lambda.null_resource.archive[0] (deposed object a1368ae1): Refreshing state... [id=8444917185959127187]
module.lambda.null_resource.archive[0] (deposed object 3ee143fa): Refreshing state... [id=2570387637007116861]
module.lambda.data.external.archive_prepare[0]: Reading...
module.lambda.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda.local_file.archive_plan[0]: Refreshing state... [id=1d2fec2aa23f12935188f6ddd1bd17d7b1110ead]
module.lambda.null_resource.archive[0]: Refreshing state... [id=5040916103027543579]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.lambda.data.aws_region.current: Reading...
module.eventbridge.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.lambda.data.aws_caller_identity.current: Reading...
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3959961479]
module.eventbridge.data.aws_partition.current: Reading...
module.lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eventbridge.data.aws_region.current: Reading...
module.eventbridge.data.aws_partition.current: Read complete after 0s [id=aws]
module.eventbridge.aws_iam_role.eventbridge[0]: Refreshing state... [id=role-eventbridge-test-githubciosns-pre-playground-playground]
module.eventbridge.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda.data.aws_partition.current: Reading...
module.lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda.aws_iam_role.lambda[0]: Refreshing state... [id=test-githubciosns-pre-playground]
module.eventbridge.data.aws_caller_identity.current: Read complete after 0s [id=891377079132]
module.lambda.data.aws_caller_identity.current: Read complete after 0s [id=891377079132]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]
module.eventbridge.aws_cloudwatch_event_rule.this["crons-1mins"]: Refreshing state... [id=crons-1mins-rule]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eventbridge.aws_cloudwatch_event_target.this["test-githubciosns-pre-playground"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "crons-1mins-rule"
      + target_id      = (known after apply)
    }

  # module.lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.lambda.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/test-githubciosns-pre-playground"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.lambda.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "test-githubciosns-pre-playground-logs"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "test-githubciosns-pre-playground"
    }

  # module.lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "test-githubciosns-pre-playground"
      + filename                       = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
      + function_name                  = "test-githubciosns-pre-playground"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::891377079132:role/test-githubciosns-pre-playground"
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Backup"                = "false"
          + "Entity"                = "playground"
          + "Environment"           = "dev"
          + "Name"                  = "test-githubciosns-pre-playground"
          + "Owner"                 = "infraestructura"
          + "Tier"                  = (known after apply)
          + "Workload"              = "aplicativo"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_BASE_URL" = "dev-prextamos.prexcard.com.ar"
              + "API_KEY"      = "1231abcd"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }
    }

  # module.lambda.aws_lambda_permission.unqualified_alias_triggers["crons-1mins"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "test-githubciosns-pre-playground"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-east-2:891377079132:rule/crons-1mins-rule"
      + statement_id        = (known after apply)
      + statement_id_prefix = "crons-1mins"
    }

  # module.lambda.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5040916103027543579" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1736971427022533800" -> "1736971553645478000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda.null_resource.archive[0] (deposed object 3ee143fa) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2570387637007116861" -> null
      - triggers = {
          - "filename"  = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
          - "timestamp" = "1736969397422268000"
        } -> null
    }

  # module.lambda.null_resource.archive[0] (deposed object a1368ae1) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8444917185959127187" -> null
      - triggers = {
          - "filename"  = "builds/dfee488785f0e3ae0828e284a1b2b1001d332f29c7971fc18590e5e31ae4df2d.zip"
          - "timestamp" = "1736970378090556000"
        } -> null
    }

Plan: 7 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + lambda_function_arn  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>